src/Documents/ДолжностнаяИнструкция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ДолжностнаяИнструкция</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстДолжностнойИнструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ДолжностнаяИнструкция/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Если Объект.ТекстДолжностнойИнструкции = "" Тогда
		Элементы.ДекорацияТекстДИ.Заголовок = Объект.Подписант.Должность.ДолжностнаяИнструкция;
	Иначе
		Элементы.ДекорацияТекстДИ.Заголовок = Объект.ТекстДолжностнойИнструкции;   
	КонецЕсли;
	
	Элементы.ДекорацияНазваниеВУЗа.Заголовок = Константы.НаименованиеВУЗа.Получить();
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.ГруппаПоложенияДолжностнойИнструкции.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.ГруппаПоложенияДолжностнойИнструкции.Видимость = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.Подписант.Должность.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьТекста();  
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТекстДолжностнойИнструкции = Элементы.ДекорацияТекстДИ.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Сотрудник = ТекущийОбъект.Подписант.ПолучитьОбъект();
	Сотрудник.ДолжностнаяИнструкция = ТекущийОбъект.Ссылка;
	Сотрудник.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры
#КонецОбласти
